Autodesk.Revit.DB.Architecture.ContinuousRailType.EndOrTopTermination
The termination of the rail at the end or top.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The termination is not a valid termination symbol for continuous rail.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.Architecture.ContinuousRailType.StartOrBottomTermination
The termination of the rail at the beginning or bottom.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The termination is not a valid termination symbol for continuous rail.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.Architecture.ContinuousRailType.ProfileId
The id of the profile of the rail
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The profileId is neither a valid element id nor invalidElementId.
-or-
When setting this property: The profileId is not a valid profile symbol for continuous rail.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013